# 1. Data Type Constraints

**Importing Data**
<br>
This dataset is about ride sharing, it contains information about each ride trip.<br>
<br>information available are:<br>
- rideID
- duration
- source station ID
- souce station name
- destination station ID
- destination station name 
- bike IDF
- user type
- user birth year
- user gender

In [1]:
import numpy as np
import pandas as pd
filepath = "D:/cleaning_data/data/ride_sharing_new.csv"
ride_sharing = pd.read_csv(filepath)
ride_sharing.head()

,Unnamed: 0,duration,station_A_id,station_A_name,station_B_id,station_B_name,bike_id,user_type,user_birth_year,user_gender
0,0,12 minutes,81,Berry St at 4th St,323,Broadway at Kearny,5480,2,1959,Male
1,1,24 minutes,3,Powell St BART Station (Market St at 4th St),118,Eureka Valley Recreation Center,5193,2,1965,Male
2,2,8 minutes,67,San Francisco Caltrain Station 2 (Townsend St...,23,The Embarcadero at Steuart St,3652,3,1993,Male
3,3,4 minutes,16,Steuart St at Market St,28,The Embarcadero at Bryant St,1883,1,1979,Male
4,4,11 minutes,22,Howard St at Beale St,350,8th St at Brannan St,4626,2,1994,Male

**Ride Duration**
<br>

The very first thing to spot as a data analyst, is the duration column values, as you can see the values contain "minutes", which is not what it should be, we need this to be pure `numerical` data type, not `string`!

In [7]:
ride_sharing['duration']

0        12 minutes
1        24 minutes
2         8 minutes
3         4 minutes
4        11 minutes
            ...
25755    11 minutes
25756    10 minutes
25757    14 minutes
25758    14 minutes
25759    29 minutes
Name: duration, Length: 25760, dtype: object

**Let's handle this!**
<br>

**1. First:** remove the text minutes from every value
   - we will use the function `strip` from the `str` module
   - and store the new value in a new column: `duration_trim`

In [8]:
ride_sharing['duration_trim'] = ride_sharing['duration'].str.strip('minutes')
ride_sharing['duration_trim']

0        12
1        24
2         8
3         4
4        11
        ...
25755    11
25756    10
25757    14
25758    14
25759    29
Name: duration_trim, Length: 25760, dtype: object

**2. Second:** convert the data type to integer
- we will apply the `astype` method into `duration_trim`
- and store the new values in a new column: `duration_time`

In [9]:
# Convert duration to integer
ride_sharing['duration_time'] = ride_sharing['duration_trim'].astype('int')
ride_sharing['duration_time']

0        12
1        24
2         8
3         4
4        11
         ..
25755    11
25756    10
25757    14
25758    14
25759    29
Name: duration_time, Length: 25760, dtype: int32

**3. Check with an assert statement**

In [10]:
assert ride_sharing['duration_time'].dtype == 'int'

We can now get insight about the average duration time!

In [12]:
print("Average Ride Duration:")
print(str(ride_sharing['duration_time'].mean()) + ' minutes')

Average Ride Duration:
11.389052795031056 minutes

**User Type**
<br>
Let's have a look at the user type column by calling the `describe` method

In [2]:
ride_sharing['user_type'].describe()

count    25760.000000
mean         2.008385
std          0.704541
min          1.000000
25%          2.000000
50%          2.000000
75%          3.000000
max          3.000000
Name: user_type, dtype: float64

When we called the describe method, it turned out that pandas treates this information as `float`, while its a `categorical` information.
<br>
Errors with regards to **data type constraints** are very common and important to handle in the data cleaning process.
<br>

`user_type` shouldn't be treated as `float`, it is **categorical**
<br>

The `user_type` column contains information on whether a user is taking<br>a free ride and takes on the following values:

    1 for free riders.
    2 for pay per ride.
    3 for monthly subscribers.

**Let's fix this and convert the data type column to categorical**

In [3]:
# Convert user_type to category
ride_sharing['user_type_cat'] = ride_sharing['user_type'].astype('category')

**Let's check with as assert statement**

In [4]:
# Write an assert statement confirming the change
assert ride_sharing['user_type_cat'].dtype == 'category'

**Let's double-check manually**

In [6]:
# Print new summary statistics 
ride_sharing['user_type_cat'].describe()

count     25760
unique        3
top           2
freq      12972
Name: user_type_cat, dtype: int64

**Great!** 
<br>
Take a look at the new summary statistics, it seems that most users are pay per ride users because the top category is 2

**Problems with data types are solved!**

# 2. Inconsistent Categories

**Importing Data**
<br>
This dataset is about airline flights, it contains people survey resposnses about a flight.<br>
<br>information available are:<br>
- response ID
- flight ID
- day
- airline
- destination country
- destination region
- boarding area
- departure time
- waiting minutes
- how clean the plan was
- how safe the flight was
- satisfaction level of the flight

In [13]:
filepath = "D:/cleaning_data/data/airlines_final.csv"
airlines = pd.read_csv(filepath)
airlines.head()

,Unnamed: 0,id,day,airline,destination,dest_region,dest_size,boarding_area,dept_time,wait_min,cleanliness,safety,satisfaction
0,0,1351,Tuesday,UNITED INTL,KANSAI,Asia,Hub,Gates 91-102,2018-12-31,115.0,Clean,Neutral,Very satisfied
1,1,373,Friday,ALASKA,SAN JOSE DEL CABO,Canada/Mexico,Small,Gates 50-59,2018-12-31,135.0,Clean,Very safe,Very satisfied
2,2,2820,Thursday,DELTA,LOS ANGELES,West US,Hub,Gates 40-48,2018-12-31,70.0,Average,Somewhat safe,Neutral
3,3,1157,Tuesday,SOUTHWEST,LOS ANGELES,West US,Hub,Gates 20-39,2018-12-31,190.0,Clean,Very safe,Somewhat satsified
4,4,2992,Wednesday,AMERICAN,MIAMI,East US,Hub,Gates 50-59,2018-12-31,559.0,Somewhat clean,Very safe,Somewhat satsified

**How to check for inconsistencies in categorical variables?**
<br>
Applying the `unique` method on the categorical feature to spot errors

**Let's make a list of the categorical features**

In [32]:
airlines.columns

Index(['Unnamed: 0', 'id', 'day', 'airline', 'destination', 'dest_region',
       'dest_size', 'boarding_area', 'dept_time', 'wait_min', 'cleanliness',
       'safety', 'satisfaction'],
      dtype='object')

In [33]:
categorical_features = ['day', 'airline', 'destination', 'dest_region',
       'dest_size', 'boarding_area', 'cleanliness',
       'safety', 'satisfaction']

**Build a function to check the unique values**

In [47]:
def check_unique(col):
    print('------------------------------------------------------------------')
    print(f"Column: {col}")
    print(airlines[col].unique())

**Looping over the list**

In [48]:
for col in categorical_features:
    check_unique(col)
print('------------------------------------------------------------------')

------------------------------------------------------------------
Column: day
['Tuesday' 'Friday' 'Thursday' 'Wednesday' 'Saturday' 'Sunday' 'Monday']
------------------------------------------------------------------
Column: airline
['UNITED INTL' 'ALASKA' 'DELTA' 'SOUTHWEST' 'AMERICAN' 'JETBLUE'
 'AEROMEXICO' 'AIR CANADA' 'UNITED' 'INTERJET' 'TURKISH AIRLINES'
 'AIR FRANCE/KLM' 'HAWAIIAN AIR' 'COPA' 'WOW' 'KOREAN AIR' 'EMIRATES'
 'AVIANCA' 'AER LINGUS' 'CATHAY PACIFIC' 'BRITISH AIRWAYS'
 'PHILIPPINE AIRLINES' 'LUFTHANSA' 'QANTAS' 'FRONTIER' 'CHINA EASTERN'
 'EVA AIR' 'VIRGIN ATLANTIC' 'AIR NEW ZEALAND' 'SINGAPORE AIRLINES'
 'AIR CHINA' 'CHINA SOUTHERN' 'ANA ALL NIPPON']
------------------------------------------------------------------
Column: destination
['KANSAI' 'SAN JOSE DEL CABO' 'LOS ANGELES' 'MIAMI' 'NEWARK' 'LONG BEACH'
 'MEXICO CITY' 'TORONTO' 'PORTLAND' 'SAN DIEGO' 'BOSTON' 'SPOKANE'
 'GUADALAJARA' 'MINNEAPOLIS-ST. PAUL' 'NEW YORK-JFK' 'ISTANBUL'
 'BALTIMORE' 'LAS VEGAS' 'SHANGHAI' 'TOKYO-NARITA' 'PARIS-DE GAULLE'
 'HONOLULU' 'DALLAS-FT. WORTH' 'PANAMA CITY' 'PHOENIX' 'REYKJAVIK'
 'SAN ANTONIO' 'HONG KONG' 'SEOUL' 'DUBAI' "CHICAGO-O'HARE" 'INDIANAPOLIS'
 'SAN SALVADOR' 'SALT LAKE CITY' 'BEIJING' 'DUBLIN' 'WASHINGTON DC-DULLES'
 'LONDON HEATHROW' 'MANILA' 'RALEIGH-DURHAM' 'VANCOUVER' 'MUNICH'
 'NEW ORLEANS' 'FRANKFURT' 'SYDNEY' 'KAHULUI' 'AMSTERDAM' 'ATLANTA'
 'SEATTLE' 'DETROIT' 'SANTA BARBARA' 'PHILADELPHIA' 'DENVER' 'BAKERSFIELD'
 'AUSTIN' 'CALGARY' 'TAIPEI' 'ONTARIO (CALIF)' 'BURBANK' 'CHARLOTTE'
 'AUCKLAND' 'SINGAPORE' 'ORLANDO' 'NASHVILLE' 'WUHAN' 'HOUSTON-BUSH'
 'FT. LAUDERDALE' 'SANTA ANA' 'EUGENE' 'KANSAS CITY' 'QINGDAO'
 'PUERTO VALLARTA']
------------------------------------------------------------------
Column: dest_region
['Asia' 'Canada/Mexico' 'West US' 'East US' 'Midwest US' 'EAST US'
 'Middle East' 'Europe' 'eur' 'Central/South America'
 'Australia/New Zealand' 'middle east']
------------------------------------------------------------------
Column: dest_size
['Hub' 'Small' '    Hub' 'Medium' 'Large' 'Hub     ' '    Small'
 'Medium     ' '    Medium' 'Small     ' '    Large' 'Large     ']
------------------------------------------------------------------
Column: boarding_area
['Gates 91-102' 'Gates 50-59' 'Gates 40-48' 'Gates 20-39' 'Gates 1-12'
 'Gates 70-90' 'Gates 60-69']
------------------------------------------------------------------
Column: cleanliness
['Clean' 'Average' 'Somewhat clean' 'Somewhat dirty' 'Dirty']
------------------------------------------------------------------
Column: safety
['Neutral' 'Very safe' 'Somewhat safe' 'Very unsafe' 'Somewhat unsafe']
------------------------------------------------------------------
Column: satisfaction
['Very satisfied' 'Neutral' 'Somewhat satsified' 'Somewhat unsatisfied'
 'Very unsatisfied']
------------------------------------------------------------------

**Every thing looks fine, however, there is something wrong with `dest_region` and `dest_size`**
<br>
**Let's solve them**

`dest_region` contains region 'Europe' and region 'eur' which are the same, it also contains 'EAST US' and 'East US' which are also the same but different values because of the upper/lower case.
<br>
**Let's lower them all**

In [49]:
airlines['dest_region'] = airlines['dest_region'].str.lower() 
airlines['dest_region'].unique()

array(['asia', 'canada/mexico', 'west us', 'east us', 'midwest us',
       'middle east', 'europe', 'eur', 'central/south america',
       'australia/new zealand'], dtype=object)

**Let's replace 'eur' with 'europe'**

In [50]:
airlines['dest_region'] = airlines['dest_region'].replace({'eur':'europe'})
airlines['dest_region'].unique()

array(['asia', 'canada/mexico', 'west us', 'east us', 'midwest us',
       'middle east', 'europe', 'central/south america',
       'australia/new zealand'], dtype=object)

**the `dest_region` column solved!**
<br>

**Let's see `dest_size`**

In [51]:
airlines['dest_size'].unique()

array(['Hub', 'Small', '    Hub', 'Medium', 'Large', 'Hub     ',
       '    Small', 'Medium     ', '    Medium', 'Small     ',
       '    Large', 'Large     '], dtype=object)

As you can tell, there is a **spacing** issue with this columns<br>
How can we solve this?<br>
...<br>
Exactly! with the `strip` method from the `str` module

In [52]:
airlines['dest_size'] = airlines['dest_size'].str.strip()
airlines['dest_size'].unique()

array(['Hub', 'Small', 'Medium', 'Large'], dtype=object)

**Inconsistent categories issue has been solved!**

# 3. Cross Field Validation

Cross-Field Validation is the use of multiple fields in your dataset to sanity check the integrity of your data

In [75]:
filepath = "D:/cleaning_data/data/banking_dirty.csv"
banking = pd.read_csv(filepath)
banking.head()

,Unnamed: 0,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
0,0,870A9281,1962-06-09,58,63523.31,51295,30105.0,4138.0,1420.0,15632.0,02-09-18,22-02-19
1,1,166B05B0,1962-12-16,58,38175.46,15050,4995.0,938.0,6696.0,2421.0,28-02-19,31-10-18
2,2,BFC13E88,1990-09-12,34,59863.77,24567,10323.0,4590.0,8469.0,1185.0,25-04-18,02-04-18
3,3,F2158F66,1985-11-03,35,84132.10,23712,3908.0,492.0,6482.0,12830.0,07-11-17,08-11-18
4,4,7A73F334,1990-05-17,30,120512.00,93230,12158.4,51281.0,13434.0,18383.0,14-05-18,19-07-18

**The dataset**
<br>
This dataset contains information about bank acounts investments.<br>
The features are:<br>
- ID
- customer ID
- customer birth date
- customer age
- account amount
- investment amount
- first fund amount
- second fund amount
- third fund amount
- account open date
- last transaction date

**Where cross-field validation (CFV) can be applied?**
<br>
We can apply CFV to two columns:
1. Age 
2. inv_amount

**Age**
<br>
We can check the validity of the age by computing it manually from the birth date and check for errors
<br> <br>
**inv_amount**
<br>
We can apply CFV to the whole amount by manually sum all of the four funds and check if they sum up to the whole

**1. CFV for Age**

In [76]:
banking['birth_date']

0     1962-06-09
1     1962-12-16
2     1990-09-12
3     1985-11-03
4     1990-05-17
         ...
95    1974-08-10
96    1989-12-12
97    1984-11-29
98    1969-12-14
99    1993-05-18
Name: birth_date, Length: 100, dtype: object

Alright, first, we have to convert this to datatime

In [77]:
banking['birth_date'] = pd.to_datetime(banking['birth_date'])

In [78]:
banking['birth_date']

0    1962-06-09
1    1962-12-16
2    1990-09-12
3    1985-11-03
4    1990-05-17
        ...
95   1974-08-10
96   1989-12-12
97   1984-11-29
98   1969-12-14
99   1993-05-18
Name: birth_date, Length: 100, dtype: datetime64[ns]

Then we will find ages manually

In [89]:
import datetime as dt
today = dt.date.today()
ages_manual = (today.year - 1) - banking['birth_date'].dt.year
ages_manual

0     58
1     58
2     30
3     35
4     30
      ..
95    46
96    31
97    36
98    51
99    27
Name: birth_date, Length: 100, dtype: int64

Find consistent and inconsistent ages

In [91]:
age_equ = ages_manual == banking['Age']
consistent_ages = banking[age_equ]
inconsistent_ages = banking[~age_equ]

In [92]:
print("Number of inconsistent ages: ", inconsistent_ages.shape[0])

Number of inconsistent ages:  8

In [93]:
banking[~age_equ]

,Unnamed: 0,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
2,2,BFC13E88,1990-09-12,34,5.986377e+04,24567,10323.0,4590.0,8469.00,1185.0,25-04-18,02-04-18
8,8,E52D4C7F,1975-06-05,49,6.179589e+04,49385,12939.0,7757.0,12569.00,16120.0,22-05-17,24-10-19
12,12,EEBD980F,1990-11-20,34,5.783849e+04,50812,18314.0,1477.0,29049.48,5539.0,08-12-18,04-01-20
23,23,A1815565,1968-09-27,56,8.299604e+04,30897,16092.0,5491.0,5098.00,4216.0,07-11-17,30-09-19
32,32,8D08495A,1961-08-14,63,8.913852e+04,60795,53880.0,1325.0,2105.00,3485.0,08-08-18,05-02-19
54,54,2F4F99C1,1988-12-19,36,8.205848e+04,35758,6129.0,16840.0,10397.00,2392.0,30-12-18,11-08-18
61,61,45F31C81,1975-01-12,49,1.206753e+08,94608,15416.0,18845.0,20325.00,40022.0,05-11-18,25-12-19
85,85,7539C3B7,1974-05-14,50,1.077557e+06,91190,32692.0,30405.0,14728.00,13365.0,23-08-17,07-06-19

**2. CFV for inv_amount**

Store the partial amounts columns in a list

In [94]:
fund_columns = ['fund_A', 'fund_B', 'fund_C', 'fund_D']

Find consistent and inconsistent amounts

In [95]:
# Find rows where fund_columns row sum == inv_amount
inv_equ = banking[fund_columns].sum(axis = 1) == banking['inv_amount']

# Store consistent and inconsistent data
consistent_inv = banking[inv_equ]
inconsistent_inv = banking[~inv_equ]

print("Number of inconsistent investments: ", inconsistent_inv.shape[0])

Number of inconsistent investments:  8

In [96]:
banking[~inv_equ]

,Unnamed: 0,cust_id,birth_date,Age,acct_amount,inv_amount,fund_A,fund_B,fund_C,fund_D,account_opened,last_transaction
4,4,7A73F334,1990-05-17,30,120512.00,93230,12158.40,51281.00,13434.00,18383.00,14-05-18,19-07-18
12,12,EEBD980F,1990-11-20,34,57838.49,50812,18314.00,1477.00,29049.48,5539.00,08-12-18,04-01-20
22,22,96525DA6,1992-11-23,28,82511.24,33927,8206.00,15019.00,5559.60,6182.00,23-07-18,07-08-18
43,43,38B8CD9C,1970-06-25,50,28834.71,27531,314.00,6072.28,14163.00,7908.00,17-09-18,05-02-20
47,47,68C55974,1962-07-08,58,95038.14,66796,33764.00,5042.00,10659.00,19237.41,03-04-18,25-09-18
65,65,0A9BA907,1966-09-21,54,90469.53,70171,28615.00,21720.05,11906.00,10763.00,15-06-18,28-08-18
89,89,C580AE41,1968-06-01,52,96673.37,68466,8489.36,28592.00,2439.00,30419.00,28-09-18,17-09-18
92,92,A07D5C92,1990-09-20,30,99577.36,60407,6467.00,20861.00,9861.00,26004.16,17-11-17,16-01-20

### What to do with inconsistencies?
There is no *one size fits all* solution, the best solution requires an in-depth understanding of the dataset.<br>
We can decide to either<br>
- drop inconsistent data
- deal with inconsistent data as missing and impute them
- apply some rules due to domain knowledge

# That's it!
## Share this with others!
#### Ibrahim M. Nasser